import uptime

def iventmsg():
	test_day = uptime.day_UTC()
	day = test_day[:test_day.find(',')]
	time  = uptime.time_UTC()
	TXT = 0
	if day == 'понедельник'or day == 'Montag':
		TXT = test_day + """\n
			13:00 - Свободный день \n
			14:00 - Салон ума\n
			14:30 - Клуб разрушения \n
			20:00 - Прилив Хуаншэня \n
			22:00 - Суеверная община \n
			23:00 - Пик Якудзы"""
	elif day == 'вторник' or day =='Dienstag':
		TXT = test_day + """\n
			13:00 - Снежная луна \n
			14:00 - Салон ума \n
			14:30 - Охотник за парадами \n
			20:00 - Снежная луна \n
			22:00 - Суеверная Община \n
			23:00 - Арена клуба \n
			после 23:30 - Песнь боя мечей"""
	elif day == 'среда' or day == 'Mittwoch':
		TXT = test_day + """\n
			13:00 - Пустынный маршрут  \n
			14:00 - Салон ума \n
			14:30 - Клуб разрушения \n
			20:00 - Свободный день \n
			22:00 - Суеверная община \n
			23:00 - Хякки яко \n
			после 23:30 - Арена теста """
	elif day == 'четверг' or day == 'Donnerstag':
		TXT = test_day + """\n
			13:00 - Свободный день \n
			14:00 - Салон ума \n
			14:30 - Охотник за парадами \n
			20:00 - Прилив Хуаншэня \n
			22:00 - Суеверная община \n
			23:00 - Арена клуба"""
	elif day == 'пятница' or day == 'Freitag':
		TXT = test_day + """\n
			13:00 - Снежная луна \n
			14:00 - Салон ума \n
			14:30 - Клуб разрушения \n
			20:00 - Снежная луна \n
			22:00 - Король сплетен \n
			23:00 - Пик Якудзы \n
			После 23:30 - Война клуба"""
	elif day == 'суббота' or day == 'Samstag':
		TXT = test_day + """\n 
			13:00 - Свободный день \n
			14:00 - Сильнейший мозг \n
			14:30 - Рейн план \n
			20:00 - Пустынный маршрут \n
			22:00 - Король сплетен \n
			23:00 - Срочно! Охрана! \n
			после 23:30 - Токио -Белая луна"""
	elif day == 'воскресенье' or day == 'Sonntag':
		TXT = test_day + """\n
			13:00 - Прилив Хуаншэня \n
			14:00 - Сильнейший мозг \n
			14:30 - Песнь Л и П \n
			20:00 - Снежная луна \n
			22:00 - Король сплетен \n
			23:00 - Взрывные действия"""
	return TXT

def notification():
	test_day = uptime.day_UTC()
	day = test_day[:test_day.find(',')]
	time  = uptime.time_UTC()
	TXT = 0
	if day == 'понедельник' or day == 'Montag':
		if time == 600:
			TXT = test_day + """\n
			13:00 - Свободный день \n
			14:00 - Салон ума\n
			14:30 - Клуб разрушения \n
			20:00 - Прилив Хуаншэня \n
			22:00 - Суеверная община \n
			23:00 - Пик Якудзы"""
		elif time == 950:
			TXT = "чрез 10 минут стартует Свободный день"
		elif time == 1050:
			TXT = "через 10 минут стартует Салон ума"
		elif time == 1120:
			TXT = "через 10 минут стартует Клуб разрушения"
		elif time == 1650:
			TXT = "через 10 минут стартует Прилив Хуаншэня"
		elif time == 1850:
			TXT = "Через 10 минут стартует Суеверная община"
		elif time == 1950:
			TXT = "Через 10 минут стартует Пик Якудзы"

	elif day == 'вторник' or day =='Dienstag':
		if time == 600:
			TXT = test_day + """\n
			13:00 - Снежная луна \n
			14:00 - Салон ума \n
			14:30 - Охотник за парадами \n
			20:00 - Снежная луна \n
			22:00 - Суеверная Община \n
			23:00 - Арена клуба \n
			после 23:30 - Песнь боя мечей"""
		elif time == 950:
			TXT = "чрез 10 минут стартует Снежная луна"
		elif time == 1050:
			TXT = "через 10 минут стартует Салон ума"
		elif time == 1120:
			TXT = "через 10 минут стартует Охотник за парадами"
		elif time == 1650:
			TXT = "через 10 минут стартует Снежная луна"
		elif time == 1850:
			TXT = "Через 10 минут стартует Суеверная Община"
		elif time == 1950:
			TXT = "Через 10 минут стартует Арена клуба"
		elif time == 2020:
			TXT = "Через 10 минут стартует Песнь боя мечей"

	elif day == 'среда' or day == 'Mittwoch':
		if time == 600:
			TXT = test_day + """\n
			13:00 - Пустынный маршрут  \n
			14:00 - Салон ума \n
			14:30 - Клуб разрушения \n
			20:00 - Свободный день \n
			22:00 - Суеверная община \n
			23:00 - Хякки яко \n
			после 23:30 - Арена теста \n"""
		elif time == 950:
			TXT = "чрез 10 минут стартует Пустынный маршрут"
		elif time == 1050:
			TXT = "через 10 минут стартует Салон ума"
		elif time == 1120:
			TXT = "через 10 минут стартует Клуб разрушения"
		elif time == 1650:
			TXT = "через 10 минут стартует Свободный день"
		elif time == 1850:
			TXT = "Через 10 минут стартует Суеверная община"
		elif time == 1950:
			TXT = "Через 10 минут стартует Хякки яко"
		elif time == 2020:
			TXT = "Через 10 минут стартует Арена теста"

	elif day == 'четверг' or day == 'Donnerstag':
		if time == 600:
			TXT = test_day + """\n
			13:00 - Свободный день \n
			14:00 - Салон ума \n
			14:30 - Охотник за парадами \n
			20:00 - Прилив Хуаншэня \n
			22:00 - Суеверная община \n
			23:00 - Арена клуба"""
		elif time == 950:
			TXT = "чрез 10 минут стартует Свободный день"
		elif time == 1050:
			TXT = "через 10 минут стартует Салон ума"
		elif time == 1120:
			TXT = "через 10 минут стартует Охотник за парадами"
		elif time == 1650:
			TXT = "через 10 минут стартует Прилив Хуаншэня"
		elif time == 1850:
			TXT = "Через 10 минут стартует Суеверная община"
		elif time == 1950:
			TXT = "Через 10 минут стартует Арена клуба"
	
	elif day == 'пятница' or day == 'Freitag':
		if time == 600:
			TXT = test_day + """\n
			13:00 - Снежная луна \n
			14:00 - Салон ума \n
			14:30 - Клуб разрушения \n
			20:00 - Снежная луна \n
			22:00 - Король сплетен \n
			23:00 - Пик Якудзы \n
			После 23:30 - Война клуба"""
		elif time == 950:
			TXT = "чрез 10 минут стартует Снежная луна"
		elif time == 1050:
			TXT = "через 10 минут стартует Салон ума"
		elif time == 1120:
			TXT = "через 10 минут стартует Клуб разрушения"
		elif time == 1650:
			TXT = "через 10 минут стартует Снежная луна"
		elif time == 1850:
			TXT = "Через 10 минут стартует Король сплетен"
		elif time == 1950:
			TXT = "Через 10 минут стартует Пик Якудзы"
		elif time == 2020:
			TXT = "Через 10 минут стартует Война клуба"

	elif day == 'суббота' or day == 'Samstag':
		if time == 600:
			TXT = test_day + """\n
			13:00 - Свободный день \n
			14:00 - Сильнейший мозг \n
			14:30 - Рейн план \n
			20:00 - Пустынный маршрут \n
			22:00 - Король сплетен \n
			23:00 - Срочно! Охрана! \n
			после 23:30 - Токио -Белая луна"""
		elif time == 950:
			TXT = "чрез 10 минут стартует Свободный день"
		elif time == 1050:
			TXT = "через 10 минут стартует Сильнейший мозг"
		elif time == 1120:
			TXT = "через 10 минут стартует Рейн план"
		elif time == 1650:
			TXT = "через 10 минут стартует Пустынный маршрут"
		elif time == 1850:
			TXT = "Через 10 минут стартует Король сплетен"
		elif time == 1950:
			TXT = "Через 10 минут стартует Срочно! Охрана!"
		elif time == 2020:
			TXT = "Через 10 минут стартует Токио -Белая луна"

	elif day == 'воскресенье' or day == 'Sonntag':
		if time == 600:
			TXT = test_day + """\n
			13:00 - Прилив Хуаншэня \n
			14:00 - Сильнейший мозг \n
			14:30 - Песнь Л и П \n
			20:00 - Снежная луна \n
			22:00 - Король сплетен \n
			23:00 - Взрывные действия"""
		elif time == 950:
			TXT = "чрез 10 минут стартует Прилив Хуаншэня"
		elif time == 1050:
			TXT = "через 10 минут стартует Сильнейший мозг"
		elif time == 1120:
			TXT = "через 10 минут стартует Песнь Л и П"
		elif time == 1650:
			TXT = "через 10 минут стартует Снежная луна"
		elif time == 1850:
			TXT = "Через 10 минут стартует Король сплетен"
		elif time == 1950:
			TXT = "Через 10 минут стартует Взрывные действия"

	return TXT
print(notification())

